app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nome", "telefone", "endereco", "cep", "valor", "vencimento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def buscar
		arquivo = params[:clientes][:nome_arquivo].tempfile
		upload = CSV.table(arquivo, :col_sep => ';', :encoding => 'UTF-8')

		upload.each do |row|
			cliente = Cliente.create(
				nome: row.fetch(:nome),
				telefone: row.fetch(:telefone),
				endereco: row.fetch(:endereco),
				cep: row.fetch(:cep),
				valor: row.fetch(:valor),
				vencimento: row.fetch(:vencimento)
				)

SELECT "clientes".* FROM "clientes"
---
  def criar_pdf

    @pessoa = Cliente.all